In [4]:
import pandas as pd

In [10]:
weather={
    'Day':['1/1/2023','1/2/2023','1/3/2023','1/4/2023','1/5/2023','1/6/2023','1/7/2023','1/8/2023','1/9/2023','1/10/2023'],
    'Temprature':[32,30,31,33,28,26,10,8,28,25],
    'WindSpeed':[8,10,8,11,18,19,11,23,4,6],
    'Event':['sunny','sunny','sunny','Rain','Rain','Rain','Snow','ThunderStorm','sunny','snow']
    
}
df=pd.DataFrame(weather)
df

         Day  Temprature  WindSpeed         Event
0   1/1/2023          32          8         sunny
1   1/2/2023          30         10         sunny
2   1/3/2023          31          8         sunny
3   1/4/2023          33         11          Rain
4   1/5/2023          28         18          Rain
5   1/6/2023          26         19          Rain
6   1/7/2023          10         11          Snow
7   1/8/2023           8         23  ThunderStorm
8   1/9/2023          28          4         sunny
9  1/10/2023          25          6          snow

In [11]:
df.shape

(10, 4)

In [12]:
df.head()

        Day  Temprature  WindSpeed  Event
0  1/1/2023          32          8  sunny
1  1/2/2023          30         10  sunny
2  1/3/2023          31          8  sunny
3  1/4/2023          33         11   Rain
4  1/5/2023          28         18   Rain

In [13]:
df.tail()

         Day  Temprature  WindSpeed         Event
5   1/6/2023          26         19          Rain
6   1/7/2023          10         11          Snow
7   1/8/2023           8         23  ThunderStorm
8   1/9/2023          28          4         sunny
9  1/10/2023          25          6          snow

In [14]:
df[1:4]

        Day  Temprature  WindSpeed  Event
1  1/2/2023          30         10  sunny
2  1/3/2023          31          8  sunny
3  1/4/2023          33         11   Rain

In [15]:
df['Day']

0     1/1/2023
1     1/2/2023
2     1/3/2023
3     1/4/2023
4     1/5/2023
5     1/6/2023
6     1/7/2023
7     1/8/2023
8     1/9/2023
9    1/10/2023
Name: Day, dtype: object

In [19]:
df[df['Temprature']>30]

        Day  Temprature  WindSpeed  Event
0  1/1/2023          32          8  sunny
2  1/3/2023          31          8  sunny
3  1/4/2023          33         11   Rain

In [20]:
df[['Temprature','Day']]

   Temprature        Day
0          32   1/1/2023
1          30   1/2/2023
2          31   1/3/2023
3          33   1/4/2023
4          28   1/5/2023
5          26   1/6/2023
6          10   1/7/2023
7           8   1/8/2023
8          28   1/9/2023
9          25  1/10/2023

In [34]:
# Set Temp index
df.set_index('Day')

KeyError: "None of ['Day'] are in the columns"

In [32]:
#set permant index
df.set_index('Day',inplace=True)
df

KeyError: "None of ['Day'] are in the columns"

In [36]:
#set permant index

df

           Temprature  WindSpeed         Event
Day
1/1/2023           32          8         sunny
1/2/2023           30         10         sunny
1/3/2023           31          8         sunny
1/4/2023           33         11          Rain
1/5/2023           28         18          Rain
1/6/2023           26         19          Rain
1/7/2023           10         11          Snow
1/8/2023            8         23  ThunderStorm
1/9/2023           28          4         sunny
1/10/2023          25          6          snow

In [38]:
df.loc['1/1/2023']

Temprature       32
WindSpeed         8
Event         sunny
Name: 1/1/2023, dtype: object

In [39]:
df.reset_index(inplace=True)

In [40]:
df

         Day  Temprature  WindSpeed         Event
0   1/1/2023          32          8         sunny
1   1/2/2023          30         10         sunny
2   1/3/2023          31          8         sunny
3   1/4/2023          33         11          Rain
4   1/5/2023          28         18          Rain
5   1/6/2023          26         19          Rain
6   1/7/2023          10         11          Snow
7   1/8/2023           8         23  ThunderStorm
8   1/9/2023          28          4         sunny
9  1/10/2023          25          6          snow

In [41]:
df['Temprature'].min()

8

In [42]:
df['Temprature'].max()

33

In [43]:
df['Temprature'].std()

8.862530363527362

In [44]:
df['Temprature'].median()

28.0

In [46]:
df.describe()

       Temprature  WindSpeed
count    10.00000  10.000000
mean     25.10000  11.800000
std       8.86253   6.178817
min       8.00000   4.000000
25%      25.25000   8.000000
50%      28.00000  10.500000
75%      30.75000  16.250000
max      33.00000  23.000000

In [5]:
import pandas as pd
Student_info={
    'Rollno':[1,2,3,4,5,6,7,8,9],
    'Name':['Shrenik','Raj','Shreya','Suraj','Viki','Vijay','Ram','Shruti','Sakashi'],
    'CGP':[9.9,8.1,7.5,9.6,6.7,9.5,8,7,9.9],
    'Branch':['CSE','AIDS','AI','CSE','AIDS','CSE','CSE','AI','AIDS'],
    'Year':[3,3,3,3,3,3,3,3,3],
}
df=pd.DataFrame(Student_info)
df

   Rollno     Name  CGP Branch  Year
0       1  Shrenik  9.9    CSE     3
1       2      Raj  8.1   AIDS     3
2       3   Shreya  7.5     AI     3
3       4    Suraj  9.6    CSE     3
4       5     Viki  6.7   AIDS     3
5       6    Vijay  9.5    CSE     3
6       7      Ram  8.0    CSE     3
7       8   Shruti  7.0     AI     3
8       9  Sakashi  9.9   AIDS     3

In [6]:
df['Name']

0    Shrenik
1        Raj
2     Shreya
3      Suraj
4       Viki
5      Vijay
6        Ram
7     Shruti
8    Sakashi
Name: Name, dtype: object

In [7]:
df.set_index('Rollno')

           Name  CGP Branch  Year
Rollno
1       Shrenik  9.9    CSE     3
2           Raj  8.1   AIDS     3
3        Shreya  7.5     AI     3
4         Suraj  9.6    CSE     3
5          Viki  6.7   AIDS     3
6         Vijay  9.5    CSE     3
7           Ram  8.0    CSE     3
8        Shruti  7.0     AI     3
9       Sakashi  9.9   AIDS     3

In [8]:
df.set_index('Rollno',inplace=True)
df

           Name  CGP Branch  Year
Rollno
1       Shrenik  9.9    CSE     3
2           Raj  8.1   AIDS     3
3        Shreya  7.5     AI     3
4         Suraj  9.6    CSE     3
5          Viki  6.7   AIDS     3
6         Vijay  9.5    CSE     3
7           Ram  8.0    CSE     3
8        Shruti  7.0     AI     3
9       Sakashi  9.9   AIDS     3

In [9]:
df.reset_index(inplace=True)
df

   Rollno     Name  CGP Branch  Year
0       1  Shrenik  9.9    CSE     3
1       2      Raj  8.1   AIDS     3
2       3   Shreya  7.5     AI     3
3       4    Suraj  9.6    CSE     3
4       5     Viki  6.7   AIDS     3
5       6    Vijay  9.5    CSE     3
6       7      Ram  8.0    CSE     3
7       8   Shruti  7.0     AI     3
8       9  Sakashi  9.9   AIDS     3

In [10]:
df['CGP'].max()

9.9

In [11]:
df['CGP'].min()

6.7

In [12]:
df['CGP'].mean()

8.466666666666667

In [13]:
df['CGP'].median()

8.1

In [14]:
df['CGP'].std()

1.2757350822173072

In [19]:
df['Name'][df['CGP']>=9]

0    Shrenik
3      Suraj
5      Vijay
8    Sakashi
Name: Name, dtype: object

In [23]:
df['Name'][df['Rollno']<5]

0    Shrenik
1        Raj
2     Shreya
3      Suraj
Name: Name, dtype: object